app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "age", "roll_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "student1"], ["age", 16], ["roll_number", 101], ["created_at", "2016-07-18 17:52:31.313986"], ["updated_at", "2016-07-18 17:52:31.313986"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "student 1"], ["updated_at", "2016-07-18 17:53:23.048311"], ["id", 1]]

    def set_student
      binding.pry
      @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]